#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azuread_directory_role.UserAdministrator: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b]
azuread_directory_role.user_admin: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b]
data.azuread_application.mySlackBotApp2: Reading...
data.azuread_application.slackbot_app: Reading...
data.azuread_user.greg: Reading...
data.azuread_application.mySlackBotApp2: Read complete after 0s [id=7c710e62-feda-4c75-b2bf-11fba302c170]
data.azuread_service_principal.mySlackBotApp2: Reading...
data.azuread_user.greg: Read complete after 1s [id=948bddda-2615-40bb-98b8-2554b364b54a]
azuread_directory_role_member.slackbot_user_admin: Refreshing state... [id=45e72cc6-0b68-45eb-b44d-55398659d32b/member/948bddda-2615-40bb-98b8-2554b364b54a]
data.azuread_application.slackbot_app: Read complete after 1s [id=7c710e62-feda-4c75-b2bf-11fba302c170]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.LangChain-Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNmY5YzUwOS04YWFkLTQ4MjctYWY4ZS0yYzc2ZWFmNzEwYWE7b2JqZWN0SWQ9MTI4NWFhOTktNTliMi00ZWViLWEyOTktYzVlNTY0NDVjZmUxO3N1YnNjcmlwdGlvbklkPTEyZDg2MDcyLTAzNmMtNGNkZS05YjY1LTVkNzU2MDE2NTM4Njt0ZW5hbnRJZD01NDY5ZDEzNy0zNDlmLTQwNjAtYjgwNy1mZWYzYjQ5MjgxMmI=]
azurerm_service_plan.serviceplan: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan]
azurerm_resource_group_template_deployment.bing_search_deployment: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Resources/deployments/bing-search-deployment]
azurerm_key_vault.slackbot_secrets: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets]
azurerm_cognitive_account.LangChain_Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.CognitiveServices/accounts/LangChain-Experiments]
azurerm_redis_cache.bot-cache: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Cache/redis/LangChain-Experiments]
azurerm_storage_account.gnwosutfstatestorageacc: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Storage/storageAccounts/gnwosutfstatestorageacc]
data.azuread_service_principal.mySlackBotApp2: Read complete after 1s [id=1285aa99-59b2-4eeb-a299-c5e56445cfe1]
data.azuread_user.greg_data: Reading...
data.azuread_user.greg_data: Read complete after 1s [id=948bddda-2615-40bb-98b8-2554b364b54a]
azurerm_key_vault_secret.bing_service_acccess_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/bing-service-access-key/4e3cdc1c829a471488479f648153bce7]
azurerm_key_vault_secret.bing_service_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/bing-service-endpoint/4768e5359e0b4873ac5321fa31c1a9e1]
azurerm_key_vault_access_policy.slackbot_app: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets/objectId/1285aa99-59b2-4eeb-a299-c5e56445cfe1]
azurerm_key_vault_secret.slackbot_synth_primary_access_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-primary-access-key/e773f33f5992439580f3778c37256365]
azurerm_key_vault_secret.slackbot_azure_cogservices_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/cogservices-key/b4f4afff66594b2db7555e1300f92d95]
azurerm_key_vault_secret.slackbot_synth_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-endpoint/c79029ee8c084426bfe4878bae5bdc5e]
azurerm_linux_web_app.slackbotwebapp: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp]
azurerm_key_vault_secret.slackbot_redis_hostname: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/ed8606123a1c4caabc68d7d540c35aba]
azurerm_key_vault_secret.slackbot_redis_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/1150d7acde9747c8b820d6bcb35bcdb2]
azurerm_storage_container.gnwosutfstatestoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/gnwosutfstatestoragecont]
azurerm_storage_container.slackbotfunctionappstoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/slackbotfunctionappstoragecont]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.app_insights will be created
  + resource "azurerm_application_insights" "app_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "LangChain-Experiments-appinsight"
      + resource_group_name                   = "LangChain-Experiments"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # azurerm_key_vault_secret.slackbot_redis_hostname will be updated in-place
  ~ resource "azurerm_key_vault_secret" "slackbot_redis_hostname" {
        id                      = "https://slackbot-secrets.vault.azure.net/secrets/redis-key/ed8606123a1c4caabc68d7d540c35aba"
        name                    = "redis-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.function_app will be created
  + resource "azurerm_linux_function_app" "function_app" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "slackbotfunctionapp"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "LangChain-Experiments"
      + service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
      + site_credential                   = (sensitive value)
      + storage_account_name              = "gnwosutfstatestorageacc"
      + storage_uses_managed_identity     = false
      + zip_deploy_file                   = (known after apply)

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }

      + storage_account {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # azurerm_linux_web_app.slackbotwebapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "slackbotwebapp" {
        id                                = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp"
        name                              = "slackbotwebapp"
      ~ service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/serverfarms/serviceplan" -> "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
        tags                              = {}
        # (17 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          - http_logs {
              - file_system {
                  - retention_in_days = 0 -> null
                  - retention_in_mb   = 25 -> null
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Deprecated Resource

  with azuread_directory_role_member.slackbot_user_admin,
  on keyvault.tf line 45, in resource "azuread_directory_role_member" "slackbot_user_admin":
  45: resource "azuread_directory_role_member" "slackbot_user_admin" {

This resource is deprecated and will be removed in version 3.0 of the AzureAD
provider. Please use the `azuread_directory_role_assignment` resource
instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @gregnwosu, Action: `pull_request`, Working Directory: ``, Workflow: `Build and deploy Python app to Azure Web App - slackbotwebapp`*